#+title: Elden Ring Walkthrough
#+author: KRV Perera
#+email: rukshan.viduranga@gmail.com

* Navigation
:PROPERTIES:
:CUSTOM_ID: TOP
:END:

[[file:krvperera.org][Home]] [[file:office.org][OFFICE]] [[file:linux.org][LINUX]] [[file:country.org][Country]] [[file:org-mode-reference-in.org][HotKeys]] [[file:Professional.org][Professional]] [[#BOTTOM][BOTTOM]]

* Builds


| Stat         | cap1 |   cap2 | cap3 |
|--------------+------+--------+------|
| Vigor        |   40 |        |   60 |
| Mind         |      |     55 |   60 |
| Endurance    |      |     50 |      |
| Strength     |   20 |     55 |   80 |
| Dexterity    |   20 |     55 |   80 |
| Intelligence |   20 | 50, 60 |   80 |
| Faith        |   20 | 50, 60 |   80 |
| Arcane       |   20 | 50, 60 |   80 |

** Spellsword Build - The Exiled Mage [[https://www.youtube.com/watch?v=BLTmyVRAMrw&list=PL7RtZMiaOk8gF9ezBWxRgN6awSM91rAeT&index=13][Link]]

| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    22 |
| Endurance    |    30 |
| Strength     |    30 |
| Dexterity    |    18 |
| Intelligence |    50 |
| Faith        |    14 |
| Arcane       |     9 |
|--------------+-------|
| Total        |   233 |
#+TBLFM: @>$2=vsum(@I..@II)

| Item                      | Effect             | Value | Level |                 |
|---------------------------+--------------------+-------+-------+-----------------|
| Magic Nightrider Glaive   | Attack Power       |   727 |    25 | Sword Dance     |
| Lordsworns Straight Sword | Attack Power       |   517 |    25 | Hearfrost Stomp |
| Erdtree Great Shield      | Golden Retaliation |   517 |    10 |                 |
| Academy Glintstone Staff  | Sorcery Scaling    |   269 |    25 |                 |
| Loretta's War Sickle      |                    |       |    10 |                 |
|---------------------------+--------------------+-------+-------+-----------------|

Erdtree Favour, Marika's Soreseal, Radagon Icon, Graven-Mass Talisman

** Quality

| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    13 |
| Endurance    |    34 |
| Strength     |    55 |
| Dexterity    |    55 |
| Intelligence |     9 |
| Faith        |    14 |
| Arcane       |     9 |
|--------------+-------|
| Total        |   249 |
#+TBLFM: @>$2=vsum(@I..@II)

** Faith Build - Golden God [[https://www.youtube.com/watch?v=DFRYbiwYajE&list=PL7RtZMiaOk8gF9ezBWxRgN6awSM91rAeT&index=9][Link]]

| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    25 |
| Endurance    |    25 |
| Strength     |    17 |
| Dexterity    |    25 |
| Intelligence |     9 |
| Faith        |    80 |
| Arcane       |     9 |
|--------------+-------|
| Total        |   250 |
#+TBLFM: @>$2=vsum(@I..@II)

** Hybrid Caster Build - The Pursuer

| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    41 |
| Endurance    |    10 |
| Strength     |    12 |
| Dexterity    |    12 |
| Intelligence |    50 |
| Faith        |    50 |
| Arcane       |    14 |
|--------------+-------|
| Total        |   249 |
#+TBLFM: @>$2=vsum(@I..@II)

| Item                     | Effect              | Value | Level |
|--------------------------+---------------------+-------+-------|
| Sword of Night and Flame | Attack Power        |   701 |    10 |
| Golden Order seal        | Incantation Scaling |   345 |    10 |
| Prince of Deaths Staff   | Sorcery Scaling     |   286 |    25 |
|--------------------------+---------------------+-------+-------|

Erdtree Favour, Marika's Soreseal, Radagon Icon, Graven-Mass Talisman

* Main ideas

** Assasin
*** Golden parry
This is royal capital need to wait some time
**** Buckler parry
**** Best small shield
Iron Roundshield

*** Good bow
*** Good Crit Damage
*** Stance break
*** Poise Armor
*** Assassin's Cerulean Dagger - Black Knife Catacombs - NE Liurnia Of the Lakes

* Walk Through
** FightinCowboy
:PROPERTIES:
:CUSTOM_ID: FIGHTINCOWBOY
:END:
*** TODO [[https://www.youtube.com/watch?v=p4uxeniQsg4&list=PL7RtZMiaOk8gdRf130w4gFYyhstL-5VRh&index=11][Stormveil Castle]]
**** TODO Defeat the Crucible Knight

*** TODO PART 12 - [[https://www.youtube.com/watch?v=EQzBxb_ZQWQ&list=PL7RtZMiaOk8gdRf130w4gFYyhstL-5VRh&index=12][Godrick the Grafted]]
**** TODO Seed beast - door is open from Rampart tower

There is one thing you missed in Limgrave, an artist shack that will allow you to get the Incantation Scarab. Start at the Murkwater Coast grace, take the nearby spirit spring east to find the Artist Shack grace. Examine the painting and then go to the Seaside Ruins grace (south of Dragon-Burnt Ruins) and go northwest along the cliffs until the guy in the chair spawns. He will disappear after a second and leave behind the Incantation Scarab.


*** TODO
* Assasin Stealth
[[https://www.youtube.com/watch?v=xCKi6g-Fm_E][Assasing Stealth]]
[[https://www.youtube.com/watch?v=DxCpnGtO1ns][ELDEN RING - The Best CRITICAL HIT VAMPIRIC BUILD for EVERYTHING: PARRY, STANCE BREAK & BACKSTABS]]


* Channels
:PROPERTIES:
:CUSTOM_ID: CHANNELS
:END:
** [[https://www.youtube.com/watch?v=iSjviLX1x1g][KhrazeGaming]]




[[#TOP][TOP]]

* Bottom Navigation
:PROPERTIES:
:CUSTOM_ID: BOTTOM
:END:
